---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToDoCompatiblePhaseWarning
source: html/6e4896ea-147f-e79e-79b7-f17f4039452f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.FailToDoCompatiblePhaseWarning Property

The solution is failing to do the elements Phases are compatible.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailToDoCompatiblePhaseWarning { get; }
```